.emacs.d/config/config.el
(defconst my/before-load-init-time (current-time))

;;;###autoload
(defun my/load-init-time ()
  "Loading time of user init files including time for `after-init-hook'."
  (let ((time1 (float-time
                (time-subtract after-init-time my/before-load-init-time)))
        (time2 (float-time
                (time-subtract (current-time) my/before-load-init-time))))
    (message (concat "Loading init files: %.0f [msec], "
                     "of which %.f [msec] for `after-init-hook'.")
             (* 1000 time1) (* 1000 (- time2 time1)))))
(add-hook 'after-init-hook #'my/load-init-time t)

(defvar my/tick-previous-time my/before-load-init-time)

;;;###autoload
(defun my/tick-init-time (msg)
  "Tick boot sequence at loading MSG."
  (when my/loading-profile-p
    (let ((ctime (current-time)))
      (message "---- %5.2f[ms] %s"
               (* 1000 (float-time
                        (time-subtract ctime my/tick-previous-time)))
               msg)
      (setq my/tick-previous-time ctime))))

(defun my/emacs-init-time ()
  "Emacs booting time in msec."
  (interactive)
  (message "Emacs booting time: %.0f [msec] = `emacs-init-time'."
           (* 1000
              (float-time (time-subtract
                           after-init-time
                           before-init-time)))))

(add-hook 'after-init-hook #'my/emacs-init-time)

(defconst my/saved-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

(setq gc-cons-threshold (* 128 1024 1024))

;;; OS
(add-to-list 'load-path "~/.emacs.d/config/os/")

(defvar os-type nil)

(cond
  ((string-match "linux" system-configuration)        ;; Linux
    (load "linux.el")
    )
  ((string-match "mingw" system-configuration)        ;; Windows
    (load "win.el")
    )
  ((string-match "apple-darwin" system-configuration) ;; Mac
    (load "darwin.el")
    )
  ((string-match "freebsd" system-configuration)      ;; FreeBSD
    (load "linux.el")
    )
  )

;; C-h = backspace
(bind-key* "\C-h" 'delete-backward-char)

;; jump to correrspoinding bracket
(bind-key* "\M-n" 'forward-list)
(bind-key* "\M-p" 'backward-list)

;; shift- arrow でウィンドウ間を移動
(windmove-default-keybindings)
(setq windmove-wrap-around t)

;; comment, uncomment
(bind-key* "\C-cc" 'comment-or-uncomment-region)

;; save buffer
(bind-key* "C-x C-s" 'save-buffer)

;; replace-regexp
(bind-key* "C-M-%" 'query-replace-regexp)
(bind-key* "C-M-5" 'query-replace-regexp)

;; 背景の設定
(set-background-color "black");; 標準の背景色
(set-face-background 'default "black");; 標準の背景色
(set-face-foreground 'default "white");; 標準の文字色

;; hilit19 の設定
(setq hilit-background-mode 'light);; 背景色が明るい色
;; (setq hilit-background-mode 'dark);; 背景色が暗い色

;; font-lock-mode
(global-font-lock-mode t);; 色をつける
(setq font-lock-maximum-decoration t);; font-lockで の装飾レベル
(setq fast-lock nil)
(setq lazy-lock nil)
(setq jit-lock t)

;; japanese coding setting
(set-default-coding-systems 'utf-8)
(prefer-coding-system 'utf-8)

;; 背景を半透明に
(setq default-frame-alist (append (list '(alpha . (75 75))) default-frame-alist))

;; disable automatic indent
(electric-indent-mode -1)

;; enable visual feedback on selections
(setq transient-mark-mode t)

;; disable auto fill mode
(setq auto-fill-mode nil)
(global-visual-line-mode) ; 英単語の途中で折り返さない

;; C-k(kill-line) setting
(setq kill-whole-line t)

;; scroll setting
(setq scroll-step 1); vertial scroll by 1 line
(setq next-screen-context-lines 3); overlap lines of page-down

;; emphasize ( )
;; 対応する括弧をハイライト
(show-paren-mode t)

;; frame-title
;; display buffer name
(setq frame-title-format `("%f""@",(system-name);; %f:absolute path, %b:file name
     ))

;; tool bar and menu bar
(if window-system
  (tool-bar-mode -1) ;; nil?
  (menu-bar-mode -1) ;; nil?
)

;; don't show title window
(setq inhibit-startup-message t)

;; backup file setting
;; filename~ => filename.~n~
;; (setq version-control t)
;; (setq kept-old-versions 1)
;; (setq kept-new-versions 2)
;; (setq trim-versions-without-asking t)
;;(setq make-backup-files nil) ;; don't create *~
(setq auto-save-default t) ;; create backup file #*#

;;visible-bell
(setq visible-bell t)

;;行・列番号を表示する
(line-number-mode t)
(column-number-mode t)

;; バッファの最後でnewlineで新規行を追加するのを禁止する
;; (setq next-line-add-newlines nil)

;;
;;whitespace
(use-package whitespace
  :ensure nil
  :config (global-whitespace-mode 1)
  (setq whitespace-style '(face           ; faceで可視化
                            trailing       ; 行末
                            tabs           ; タブ
                            spaces         ; スペース
                            empty          ; 先頭/末尾の空行
                            space-mark     ; 表示のマッピング
                            tab-mark))
  (setq whitespace-display-mappings '((space-mark ?\u3000 [?\u25a1])
                                       ;; WARNING: the mapping below has a problem.
                                       ;; When a TAB occupies exactly one column, it will display the
                                       ;; character ?\xBB at thacot lumn followed by a TAB which goes to
                                       ;; the next TAB column.
                                       ;; If this is a problem for you, please, comment the line below.
                                       (tab-mark ?\t [?\u00BB ?\t]
                                         [?\\ ?\t])))

  ;; スペースは全角のみを可視化
  (setq whitespace-space-regexp "\\(\u3000+\\)")
  ;; 保存前に自動でクリーンアップ
  (setq whitespace-action '(auto-cleanup))
  :custom-face (whitespace-trailing ((t (:foreground "DeepPink"
                                          :background "orange"
                                          :underline t))))
  (whitespace-tab ((t (:foreground "LightSkyBlue"
                        :underline t))))
  (whitespace-space ((t (:foreground "GreenYellow"
                          :background "orange"
                          :bold t))))
  (whitespace-empty ((t (:background "orange"
                          :bold t)))))

(fset 'yes-or-no-p 'y-or-n-p)

(setq history-delete-duplicates t)

(setq vc-follow-symlinks t)

;;
;;find-file時にバックアップファイルなども表示しない
(defadvice completion-file-name-table  (after ignoring-backups-f-n-completion activate)
  "filter out results when the have completion-ignored-extensions"
  (let ((res ad-return-value))
    (if (and (listp res)
          (stringp (car res))
          (cdr res)) ; length > 1, don't ignore sole match
      (setq ad-return-value (completion-pcm--filename-try-filter res)
        )
      )
    )
  )

;;
;;縦のスクロールバーを消す
(use-package emacs
  :if window-system
  :ensure nil
  :config
  (scroll-bar-mode -1)
  )
;;
;;横方向のスクロールバーを消す
(custom-set-variables
  ;; custom-set-variables was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
  '(horizontal-scroll-bar nil t)
  '(org-safe-remote-resources '("\\`https://fniessen\\.github\\.io/org-html-themes/org/theme-readtheorg\\.setup\\'")
     )
  )
