.emacs.d/config/config.org
** emacs server start for emacs-client
:PROPERTIES:
:ID:       3843156B-265C-45C6-B19E-BA413D48F85F
:END:
#+begin_src elisp
;; server start for emacs-client
(use-package emacs
  :ensure nil
  :init (server-force-delete)
  (server-start)
  )
#+end_src



** arrow key bind to move flame or window
:PROPERTIES:
:ID:       620034B0-631B-482D-A58E-CBB8C0E0E5E4
:END:
#+begin_src elisp
(use-package emacs
  :ensure nil
  :bind
  ("<up>" . next-multiframe-window)
  ("<right>" . next-buffer)
  ("<left>" . previous-buffer)
  )
#+end_src
** desktop
:PROPERTIES:
:ID:       94FBEF8C-479C-4D53-8DFA-9CCD39C0D4E4
:END:
#+begin_src elisp
(use-package emacs
  :ensure nil
  :init (desktop-save-mode 1)
  :custom
  ;; Customization goes between desktop-load-default and desktop-read
  ;; (desktop-save t)
  (history-length 1000)
  (desktop-auto-save-timeout 60)
  (desktop-restore-eager 4)
  :hook (
          (after-save . desktop-save-in-desktop-dir)
          (kill-emacs . desktop-save-in-desktop-dir)
          )
  )
#+end_src
** savehist
:PROPERTIES:
:ID:       DF993C92-3F34-4015-BA71-5CC4EFEB87EC
:END:
#+begin_src elisp
(use-package emacs
  :ensure nil
  :init (savehist-mode t)
  ;; :custom
  )
#+end_src
** insert newline at end of file
:PROPERTIES:
:ID:       81805C57-D6B6-4CF7-A982-A69DFEA5EDFB
:END:
#+begin_src elisp
(setq require-final-newline t)
#+end_src
** `C-l` move up directory in `find-file`
:PROPERTIES:
:ID:       0675FAA9-91E4-4B83-84A1-332D6D01ABF2
:END:
#+begin_src elisp
(use-package emacs
  :ensure nil
  :config
  (defun my/up-directory ()
    "Minibuffer で親ディレクトリに移動する。"
    (interactive)
    (when minibuffer-completing-file-name
      (let ((dir (file-name-directory (minibuffer-contents))))
        (when dir
          (delete-minibuffer-contents)
          (insert (file-name-directory (directory-file-name dir)))))))
  :bind (:map minibuffer-local-map
          ("C-l" . #'my/up-directory)
          )
  )
#+end_src
** Native compile
:PROPERTIES:
:ID:       D25E8247-610A-4FCE-9EDB-D42DC1888F2C
:END:
#+begin_src elisp
(use-package comp
  :ensure nil
  :disabled
  :config
  (setq native-comp-async-jobs-number 8)
  (setq native-comp-speed 3)
  )
#+end_src

#+begin_src elisp
  ;; (native-compile-async "~/.emacs.d/early-init.el")
  ;; (native-compile-async "~/.emacs.d/init.el")
#+end_src
** collect backup file
:PROPERTIES:
:ID:       D30961E9-E7A1-49A0-A844-D4B5F401FFFD
:END:
#+begin_src elisp
;; バックアップとオートセーブファイルを~/.emacs.d/.backup/へ集める
(setq make-backup-files t)
(setq backup-directory-alist (cons (cons "\\.*$" (expand-file-name "~/.emacs.d/.backup")) backup-directory-alist))
(setq auto-save-file-name-transforms `((".*" ,(expand-file-name "~/.emacs.d/.backup/") t)))
#+end_src
** reopen with sudo
:PROPERTIES:
:ID:       957E3138-1A7F-4661-8623-A2167C59F7BA
:END:
#+begin_src elisp
(defun reopen-with-sudo () "Reopen current buffer-file with sudo using tramp." (interactive)
  (let ((file-name (buffer-file-name)))
    (if file-name (find-alternate-file (concat "/sudo::" file-name))
      (error "Cannot get a file name"))))
(bind-key* "C-x C-a" 'reopen-with-sudo)
#+end_src
** kill other buffer
:PROPERTIES:
:ID:       507D336A-147B-4C5C-80ED-53C45236846D
:END:
#+begin_src elisp
(defun kill-other-buffers () "kill all other buffers." (interactive)
  (mapc 'kill-buffer (delq (current-buffer)
                       (buffer-list))))
#+end_src
* Visual
:PROPERTIES:
:ID:       3B2ECB47-67EF-4C03-BC65-0DB5AF7F460A
:END:
** toggle menubar
:PROPERTIES:
:ID:       2D58580C-86FD-4E8D-A4B0-7BF5230B4EEF
:END:
#+begin_src elisp
(bind-key "<f9>" 'toggle-menu-bar-mode-from-frame)
#+end_src
** indicate empty lines by showing fringe
:PROPERTIES:
:ID:       52431F85-C2D8-45B8-BB2D-4E2E2FBB8E01
:END:
#+begin_src elisp
(setq-default indicate-empty-lines t)
#+end_src

** hi-line
:PROPERTIES:
:ID:       8404B33D-2CFF-4AB2-80D0-967431033C69
:END:
#+begin_src elisp
  (use-package emacs
    :ensure nil
    :config
    (global-hl-line-mode t)
    :custom-face
    (hl-line
     ((((class color) (background dark))
       (:background "dark slate gray" :extend t))
      (((class color) (background light))
       (:background "ForestGreen" :extend t))))
    )
#+end_src


* Utility
:PROPERTIES:
:ID:       5B2D6475-EF0C-4454-A907-BEF6B6839FCD
:END:
** exec-path-from-shell
:PROPERTIES:
:ID:       EA50138B-512B-4C07-98F1-CC16962B9140
:END:
#+begin_src elisp
;;
;;exec-path-from-shell
(use-package exec-path-from-shell
  :ensure t
  :init
  (exec-path-from-shell-initialize)
  )
#+end_src
** Aspell/flyspell
:PROPERTIES:
:ID:       12D1EC44-10F0-400A-A033-D86B59D69FD5
:END:
#+begin_src elisp
(use-package flyspell
  :ensure nil
  :defer t
  :config
  (add-to-list 'ispell-skip-region-alist '("[^\000-\377]+")) ;;日本語のなかでも英語のチェックをする
  (add-to-list 'ispell-skip-region-alist '("^#+BEGIN_SRC" . "^#+END_SRC"))
  ;; (setq ispell-program-name "aspell")
  (setq ispell-program-name "/opt/homebrew/bin/aspell")
  (setq ispell-extra-args '("--lang=en_US"))
  ;; ここに書いたモードではコメント領域のところだけ flyspell-mode が有効になる
  ;; ここに書いたモードでは flyspell-mode が有効になる
  :hook (
          (c-mode-common . flyspell-prog-mode)
          (emacs-lisp-mode . flyspell-prog-mode)
          (yatex-mode . flyspell-mode)
          (org-mode . flyspell-mode)
          )
  ;; set face
  :custom-face
  (flyspell-duplicate ((t (:foreground "white" :box nil :bold nil :underline nil))))
  (flyspell-incorrect ((t (:box t :underline nil))))
  )
#+end_src

** Dired
:PROPERTIES:
:ID:       52CD00C1-A974-42E2-98A9-3D61872A8ABA
:END:
dired, dired-toggle dired-x
#+begin_src elisp
(use-package dired-x
  :ensure nil
  :defer t
  :bind ("C-x C-j" . dired-jump)
  :bind (:map dired-mode-map
          ("(" . dired-hide-details-mode)
          ;; ("r" . wdired-change-to-wdired-mode)
          ;; ("C-h" . dired-omit-mode)
          ("C-l" . dired-up-directory)
          )
  :config
  (when (string= system-type "darwin")
    (setq dired-use-ls-dired nil)
    (setq insert-directory-program "gls")
    )
  (setq
    dired-isearch-filenames t
    dired-listing-switches "-laGh1v"
    ;; recursion
    dired-recursive-copies 'always
    dired-recursive-deletes 'always
    ;; Move deleted files to trash
    delete-by-moving-to-trash t
    )
  )

(use-package wdired
  :ensure nil
  :defer t
  :bind (:map dired-mode-map
          ("C-c C-q" . wdired-change-to-wdired-mode)
          )
  :config
  (setq wdired-allow-to-change-permissions t)
  )

;; Reuse the current dired buffer to visit a directory
(use-package dired-single
  :ensure  (
            :host github
            :repo "emacsattic/dired-single"
            :branch "master"
            :depth 1
            :protocol https
            :files ("*")
            )
  :defer t
  :config
  (setq dired-kill-when-opening-new-dired-buffer t)
  :bind (:map dired-mode-map
          ("C-m" . dired-single-buffer)
          )
  )

(use-package dired-ranger
  :ensure t
  :defer t
  ;; :bind (:map dired-mode-map
  ;;         ("W" . dired-ranger-copy)
  ;;         ("X" . dired-ranger-move)
  ;;         ("Y" . dired-ranger-paste)
  ;;         )
  )
#+end_src

** expand-region
:PROPERTIES:
:ID:       60A20584-A538-41FA-8CDE-A35F1D8E4D26
:END:
#+begin_src elisp
(use-package expand-region
  :ensure t
  :config
  ;; 真っ先に入れておかないとすぐに括弧に対応してくれない…
  (push 'er/mark-outside-pairs er/try-expand-list)
  :bind ("C-=" . er/expand-region)
  )
#+end_src

** recentf/recentf-ext
:PROPERTIES:
:ID:       5AB960BB-F985-41AA-B71E-18E74D1CC8B9
:END:
#+begin_src elisp
(use-package recentf
  :ensure nil
  :defer t
  :init
  (setq recentf-save-file "~/.emacs.d/.recentf")
  (setq recentf-max-saved-items 2000)
  (setq recentf-exclude '(".recentf" "COMMIT_EDITMSG" "/.?TAGS"))
  (setq recentf-auto-cleanup 'never)
  (run-with-idle-timer 30 t '(lambda ()
                               (with-suppressed-message (recentf-save-list)))) ;; 30秒に一度自動保存
  (recentf-mode 1)
  )

(use-package recentf-ext
  :ensure t
  )
#+end_src

** yasnipet
:PROPERTIES:
:ID:       CBBB91E0-6B9C-43C8-929F-BBFAB8856B8F
:END:
#+begin_src elisp
(use-package yasnippet
  :ensure (
            :host github
            :repo "joaotavora/yasnippet"
            :branch "master"
            :depth 1
            :protocol https
            :files ("*")
            )
  :defer t
  :commands (yas-insert-snippet)
  :config
  ;; yas起動
  (setq yas-snippet-dirs (list
                            (expand-file-name "~/.emacs.d/misc/mysnippets") ;; 自分用のスニペットフォルダ
                            (expand-file-name "~/.emacs.d/misc/snippets")   ;; ダウンロードしたもの
                            )
    )

  (yas-global-mode 1)
  ;; :bind (:map yas-minor-mode-map
  ;;         ("C-x i" . yas-insert-snippet)
  ;;         )
  :bind ("C-c i s" . yas-insert-snippet)
  )
#+end_src

