.emacs.d/config/config.el

;; server start for emacs-client
(use-package emacs
  :ensure nil
  :init (server-force-delete)
  (server-start)
  )

(use-package emacs
  :ensure nil
  :bind
  ("<up>" . next-multiframe-window)
  ("<right>" . next-buffer)
  ("<left>" . previous-buffer)
  )

(use-package emacs
  :ensure nil
  :init (desktop-save-mode 1)
  :custom
  ;; Customization goes between desktop-load-default and desktop-read
  ;; (desktop-save t)
  (history-length 1000)
  (desktop-auto-save-timeout 60)
  (desktop-restore-eager 4)
  :hook (
          (after-save . desktop-save-in-desktop-dir)
          (kill-emacs . desktop-save-in-desktop-dir)
          )
  )

(use-package emacs
  :ensure nil
  :init (savehist-mode t)
  ;; :custom
  )

(setq require-final-newline t)

(use-package emacs
  :ensure nil
  :config
  (defun my/up-directory ()
    "Minibuffer で親ディレクトリに移動する。"
    (interactive)
    (when minibuffer-completing-file-name
      (let ((dir (file-name-directory (minibuffer-contents))))
        (when dir
          (delete-minibuffer-contents)
          (insert (file-name-directory (directory-file-name dir)))))))
  :bind (:map minibuffer-local-map
          ("C-l" . #'my/up-directory)
          )
  )

(use-package comp
  :ensure nil
  :disabled
  :config
  (setq native-comp-async-jobs-number 8)
  (setq native-comp-speed 3)
  )

;; (native-compile-async "~/.emacs.d/early-init.el")
;; (native-compile-async "~/.emacs.d/init.el")

;; バックアップとオートセーブファイルを~/.emacs.d/.backup/へ集める
(setq make-backup-files t)
(setq backup-directory-alist (cons (cons "\\.*$" (expand-file-name "~/.emacs.d/.backup")) backup-directory-alist))
(setq auto-save-file-name-transforms `((".*" ,(expand-file-name "~/.emacs.d/.backup/") t)))

(defun reopen-with-sudo () "Reopen current buffer-file with sudo using tramp." (interactive)
  (let ((file-name (buffer-file-name)))
    (if file-name (find-alternate-file (concat "/sudo::" file-name))
      (error "Cannot get a file name"))))
(bind-key* "C-x C-a" 'reopen-with-sudo)

(defun kill-other-buffers () "kill all other buffers." (interactive)
  (mapc 'kill-buffer (delq (current-buffer)
                       (buffer-list))))

(bind-key "<f9>" 'toggle-menu-bar-mode-from-frame)

(setq-default indicate-empty-lines t)

(use-package emacs
  :ensure nil
  :config
  (global-hl-line-mode t)
  :custom-face
  (hl-line
   ((((class color) (background dark))
     (:background "dark slate gray" :extend t))
    (((class color) (background light))
     (:background "ForestGreen" :extend t))))
  )

;;
;;exec-path-from-shell
(use-package exec-path-from-shell
  :ensure t
  :init
  (exec-path-from-shell-initialize)
  )

(use-package flyspell
  :ensure nil
  :defer t
  :config
  (add-to-list 'ispell-skip-region-alist '("[^\000-\377]+")) ;;日本語のなかでも英語のチェックをする
  (add-to-list 'ispell-skip-region-alist '("^#+BEGIN_SRC" . "^#+END_SRC"))
  ;; (setq ispell-program-name "aspell")
  (setq ispell-program-name "/opt/homebrew/bin/aspell")
  (setq ispell-extra-args '("--lang=en_US"))
  ;; ここに書いたモードではコメント領域のところだけ flyspell-mode が有効になる
  ;; ここに書いたモードでは flyspell-mode が有効になる
  :hook (
          (c-mode-common . flyspell-prog-mode)
          (emacs-lisp-mode . flyspell-prog-mode)
          (yatex-mode . flyspell-mode)
          (org-mode . flyspell-mode)
          )
  ;; set face
  :custom-face
  (flyspell-duplicate ((t (:foreground "white" :box nil :bold nil :underline nil))))
  (flyspell-incorrect ((t (:box t :underline nil))))
  )

(use-package dired-x
  :ensure nil
  :defer t
  :bind ("C-x C-j" . dired-jump)
  :bind (:map dired-mode-map
          ("(" . dired-hide-details-mode)
          ;; ("r" . wdired-change-to-wdired-mode)
          ;; ("C-h" . dired-omit-mode)
          ("C-l" . dired-up-directory)
          )
  :config
  (when (string= system-type "darwin")
    (setq dired-use-ls-dired nil)
    (setq insert-directory-program "gls")
    )
  (setq
    dired-isearch-filenames t
    dired-listing-switches "-laGh1v"
    ;; recursion
    dired-recursive-copies 'always
    dired-recursive-deletes 'always
    ;; Move deleted files to trash
    delete-by-moving-to-trash t
    )
  )

(use-package wdired
  :ensure nil
  :defer t
  :bind (:map dired-mode-map
          ("C-c C-q" . wdired-change-to-wdired-mode)
          )
  :config
  (setq wdired-allow-to-change-permissions t)
  )

;; Reuse the current dired buffer to visit a directory
(use-package dired-single
  :ensure  (
            :host github
            :repo "emacsattic/dired-single"
            :branch "master"
            :depth 1
            :protocol https
            :files ("*")
            )
  :defer t
  :config
  (setq dired-kill-when-opening-new-dired-buffer t)
  :bind (:map dired-mode-map
          ("C-m" . dired-single-buffer)
          )
  )

(use-package dired-ranger
  :ensure t
  :defer t
  ;; :bind (:map dired-mode-map
  ;;         ("W" . dired-ranger-copy)
  ;;         ("X" . dired-ranger-move)
  ;;         ("Y" . dired-ranger-paste)
  ;;         )
  )

(use-package expand-region
  :ensure t
  :config
  ;; 真っ先に入れておかないとすぐに括弧に対応してくれない…
  (push 'er/mark-outside-pairs er/try-expand-list)
  :bind ("C-=" . er/expand-region)
  )

(use-package recentf
  :ensure nil
  :defer t
  :init
  (setq recentf-save-file "~/.emacs.d/.recentf")
  (setq recentf-max-saved-items 2000)
  (setq recentf-exclude '(".recentf" "COMMIT_EDITMSG" "/.?TAGS"))
  (setq recentf-auto-cleanup 'never)
  (run-with-idle-timer 30 t '(lambda ()
                               (with-suppressed-message (recentf-save-list)))) ;; 30秒に一度自動保存
  (recentf-mode 1)
  )

(use-package recentf-ext
  :ensure t
  )

(use-package yasnippet
  :ensure (
            :host github
            :repo "joaotavora/yasnippet"
            :branch "master"
            :depth 1
            :protocol https
            :files ("*")
            )
  :defer t
  :commands (yas-insert-snippet)
  :config
  ;; yas起動
  (setq yas-snippet-dirs (list
                            (expand-file-name "~/.emacs.d/misc/mysnippets") ;; 自分用のスニペットフォルダ
                            (expand-file-name "~/.emacs.d/misc/snippets")   ;; ダウンロードしたもの
                            )
    )

  (yas-global-mode 1)
  ;; :bind (:map yas-minor-mode-map
  ;;         ("C-x i" . yas-insert-snippet)
  ;;         )
  :bind ("C-c i s" . yas-insert-snippet)
  )
