.emacs.d/config/config.el

(use-package transient
  :ensure t
  :defer t
  )

;;
;;magit
(use-package magit
  :ensure t
  :defer t
  :config
  ;; always show recent commits section
  (setf (alist-get 'unpushed magit-section-initial-visibility-alist) 'show)
  :bind ("C-x g" . magit-status)
  :custom-face
  (magit-diff-added ((t (:background "black"
                          :foreground "green"))))
  (magit-diff-added-highlight ((t (:background "black"
                                    :foreground "green"))))
  (magit-diff-removed ((t (:background "black"
                            :foreground "red"))))
  (magit-diff-removed-hightlight ((t (:background "black"
                                       :foreground "red"))))
  (magit-hash ((t (:background "black"
                    :foreground "green"))))
  )

;;
;; ediff config
;; Stop the control panel in a separate frame.
(use-package ediff
  :ensure nil
  :defer t
  :bind ("C-c e d" . ediff-files)
  :config (setq ediff-window-setup-function 'ediff-setup-windows-plain)
  (setq ediff-split-window-function 'split-window-horizontally)

  ;; restore windonw configuration after ediff
  (defvar pre-ediff-window-configuration nil "window configuration to restore")
  (defvar new-ediff-frame-to-use nil "new frame for ediff to use")
  (defun save-my-window-configuration () "save window layput before ediff" (interactive)
    (setq pre-ediff-window-configuration (current-window-configuration))
    (delete-other-windows)
    (select-frame-set-input-focus (setq new-ediff-frame-to-use (selected-frame))))
  (defun restore-my-window-configuration () "load window layput after ediff" (interactive)
    (when (framep new-ediff-frame-to-use)
      ;;(delete-frame new-ediff-frame-to-use)
      (setq new-ediff-frame-to-use nil))
    (when (window-configuration-p pre-ediff-window-configuration)
      (set-window-configuration pre-ediff-window-configuration)))

  ;;set hook for ediff to restore layout
  :hook((ediff-before-setup-hook . save-my-window-configuration)
         (ediff-after-quit-hook-internal . restore-my-window-configuration)
         )
  )

;; easy-template
