.emacs.d/config/config.org
** org-mode
:PROPERTIES:
:ID:       BD8FE481-E64D-48A9-9CBD-4ED760E7AA88
:END:
#+begin_src elisp
;; easy-template
(use-package org-tempo
  :ensure nil
  :if (version<= "9.2" (org-version))
  :after (org)
  )

;; compat
;; (if (fboundp 'file-name-concat)
;;   ;; (defalias 'org-file-name-concat #'file-name-concat)
;;   (defalias 'org-file-name-concat 'file-name-concat)
;;   (defun org-file-name-concat (directory &rest components)
;;     "Append COMPONENTS to DIRECTORY and return the resulting string.

;; Elements in COMPONENTS must be a string or nil.
;; DIRECTORY or the non-final elements in COMPONENTS may or may not end
;; with a slash -- if they don't end with a slash, a slash will be
;; inserted before contatenating."
;;     (save-match-data
;;       (mapconcat
;;         #'identity
;;         (delq nil
;;           (mapcar
;;             (lambda (str)
;;               (when (and str (not (seq-empty-p str))
;;                       (string-match "\\(.+\\)/?" str))
;;                 (match-string 1 str)))
;;             (cons directory components)))
;;         "/"))))

(use-package htmlize
  :ensure t
  :defer t
  :after (org)
  )

(use-package emacs
  ;; :ensure t
  :ensure nil
  :defer t
  :config
  (setq
    org-src-fontify-natively t
    org-src-tab-acts-natively t
    org-startup-with-inline-images nil
    org-confirm-babel-evaluate nil
    org-startup-folded 'content
    org-fontify-whole-heading-line t
    org-edit-src-content-indentation 0
    org-use-speed-commands t
    org-startup-indented t
    org-indent-mode-turns-on-hiding-stars nil
    org-indent-indentation-per-level 2
    org-tags-column 0
    calendar-week-start-day 1
    org-hide-emphasis-markers nil
    org-id-link-to-org-use-id 'use-existing
    org-display-remote-inline-images 'cache
    org-return-follows-link nil
    org-element-use-cache nil
    ;; todo
    org-enforce-todo-dependencies t
    org-todo-keywords
    '((sequence "TODO(t!)" "RESOURCE(r!)" "HANDOVER(h!)" "URGENT(u!)" "WAIT(w!)" "|" "DONE(d!)" "CANCELED(c!)"))
    ;; tag/property
    org-use-tag-inheritance "ARCHIVE"
    ;; org-tags-column -57
    org-global-properties
    ;; effort
    '(("Effort_ALL". "0 0:15 0:30 0:45 1:00 1:30 2:00 3:00 4:00 6:00 8:00"))
    org-use-property-inheritance "TIMELIMIT.*"
    ;; priority
    org-highest-priority ?A
    org-lowest-priority ?Z
    org-default-priority ?E
    ;; face
    org-todo-keyword-faces
    '(
       ("RESOURCE" . (:foreground "green" :weight bold))
       ("URGENT" . (:foreground "red2" :weight bold))
       ("HANDOVER" . (:foreground "orange1" :weight bold))
       ("WAIT" . (:foreground "SpringGreen" :weight bold))
       ;; ("CANCELED" . (:weight bold))
       )
    org-cycle-separator-lines 0
    ;; logging
    org-log-into-drawer t
    org-log-done 'time
    org-log-states-order-reversed t
    org-reverse-note-order nil
    ;; archive
    org-archive-location "~/DEV/orgfiles/archive.org"
    )

  ;;Define Custom Function
  (defun my/org-open-at-point-eww (&optional arg)
    (interactive "p")
    (if (not arg)
      (org-open-at-point)
      (let ((browse-url-browser-function #'browse-url-eww))
        (org-open-at-point))))
  ;; (bind-key "C-c C-o" 'my-org-open-at-point-eww org-mode-map)
  ;; (bind-key "C-c C-O" 'my-org-open-at-point org-mode-map)

  ;; (defun my/org-add-ids-to-headlines-in-file ()
  ;;   "Add ID properties to all headlines in the current file which do not already have one."
  ;;   (interactive)
  ;;   (org-map-entries 'org-id-get-create))

(defun my/org-add-ids-to-non-link-headlines-in-file ()
  "Add ID properties to non-link headlines in the current file which do not already have one."
  (interactive)
  (org-map-entries
   (lambda ()
     (let* ((element (org-element-at-point))
            (type (org-element-type element))
            (raw-value (org-element-property :raw-value element)) ; 見出しテキストを取得
            (has-id (org-entry-get (point) "ID")) ; 既存のIDを確認
            (contains-link (string-match-p org-link-bracket-re raw-value))) ; リンクが含まれるか確認
       ;; 見出しがリンクを含まず、IDがない場合にIDを作成
       (when (and (eq type 'headline) ; 要素が見出し
                  (not contains-link) ; 見出しにリンクが含まれない
                  (not has-id)) ; 既存のIDがない
         (org-id-get-create))))))

  (add-hook 'org-mode-hook
    (lambda ()
      (add-hook 'before-save-hook 'my/org-add-ids-to-non-link-headlines-in-file nil 'local)))



  (defun html2org-yank (start end)
    (interactive "r")
    (if (use-region-p)
      (let ((selectedURL (buffer-substring-no-properties start end)))
        (forward-line)
        (if (string-match "qiita.com" selectedURL)
          (insert (shell-command-to-string (format "$HOME/dotfiles/.emacs.d/bin/html2org-qiita.py %S " selectedURL)))
          (if (string-match "wikipedia.org" selectedURL)
            (insert (shell-command-to-string (format "$HOME/dotfiles/.emacs.d/bin/html2org-wikipedia.py %S " selectedURL)))
            (insert (shell-command-to-string (format "pandoc -S --wrap=none --normalize --tab-stop=2 -f html -t org %S | sed -e 's#。#．#g' -e 's#、#，#g'" selectedURL)))
            )
          )
        (message selectedURL)
        )
      )
    )

  (bind-key "C-c C-g" 'html2org-yank org-mode-map)

  (defun imdb_info2org-yank (start end)
    (interactive "r")
    (if (use-region-p)
      (let ((selectedURL (buffer-substring-no-properties start end)))
        (forward-line)
        (if (string-match "anidb" selectedURL)
          (insert (shell-command-to-string (format "get_aniDB_info org %S" selectedURL)))
          (if (string-match "uta-net" selectedURL)
            (insert (shell-command-to-string (format "get_utanet_lyric %S" selectedURL)))
            (insert (shell-command-to-string (format "get_IMDB_info org %S" selectedURL)))
            )
          (message selectedURL)
          )
        )
      )
    )

  (bind-key "C-c C-i" 'imdb_info2org-yank org-mode-map)

  (defun org-replace-link-by-link-description ()
    "Replace an org link by its description or if empty its address"
    (interactive)
    (if (org-in-regexp org-link-bracket-re 1)
      (let ((remove (list (match-beginning 0) (match-end 0)))
             (description (if (match-end 3)
                            (match-string-no-properties 3)
                            (match-string-no-properties 1))))
        (apply 'delete-region remove)
        (insert description))
      )
    )

  (bind-key "C-c u" 'org-replace-link-by-link-description org-mode-map)

  (add-to-list 'org-emphasis-alist
    '("_" (:background "yellow" :foreground "black")
       ))

  ;;org-babel
  (when (string= system-type "darwin")
    (setq org-babel-C++-compiler "clang++")
    )
  ;; Must have org-mode loaded before we can configure org-babel
  ;; Some initial langauges we want org-babel to support
  (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))
  (org-babel-do-load-languages
    'org-babel-load-languages
    '(
       (shell . t)
       (lisp . t)
       (python . t)
       (C . t)
       (dot . t)
       (latex . t)
       ;; (typescript . t)
       )
    )
  (setq org-babel-python-command "python3")

  ;; src block
  (setq org-src-window-setup 'current-window)
  :hook (before-save . org-babel-post-tangle-hook)
  )

(use-package org-cliplink
  :disabled
  :ensure t
  :after (org)
  :bind ("C-x p i" . org-cliplink)
  )


;;
;;org-agenda
(use-package org-agenda
  :ensure nil
  ;; :after (org)
  :config
  (setq org-directory "~/orgfiles/")
  (setq org-agenda-files "~/orgfiles/log/log.org")
  ;; (setq org-agenda-files '(
  ;;                           "~/orgfiles/"
  ;;                           )
  ;;   )
  ;; (setq org-agenda-file-regexp "\\`[^.].*\\.org'\\|[0-9]+.org$")


  (setq org-agenda-inhibit-startup t)
  ;; 時間表示が 1 桁の時, 0 をつける
  (setq org-agenda-time-leading-zero t)
  ;; default で logbook を表示
  (setq org-agenda-include-inactive-timestamps t)

  ;; default で 時間を表示
  (setq org-agenda-start-with-log-mode t)

  (setq org-tag-alist
    '((:startgroup . nil)
       ("HOME" . ?h) ("OFFICE" . ?o)("IPNSPR" . ?i)("KEKPR" . ?k)
       (:endgroup . nil)
       (:newline . nil)
       (:startgroup . nil)
       ("TOPICS" . ?t) ("PRESS" . ?p)("HIGHLIGHT" . ?l)("EVENT" . ?e)
       (:endgroup . nil)
       (:newline . nil)
       (:startgroup . nil)
       ("T2K" . nil) ("BELLE" . nil)("COMET" . nil)
       (:endgroup . nil)
       (:newline . nil)
       (:startgroup . nil)
       ("READING" . ?r) ("WRITING" . ?w)("ASKING" . ?a)
       (:endgroup . nil))
    )

  (setq org-agenda-time-grid
    '((daily today require-timed)
       "----------------"
       ;; (900 1000 1100 1200 1300 1400 1500 1600 1700)))
       (000 100 200 300 400 500 600 700 800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800 1900 2000 2100 2200 2300)))

  :bind ("M-<f6>" . org-agenda)
  )


;;
;;org-roam
(use-package org-roam
  :if window-system
  :ensure t
  :after (org)
  :config
  ;; open in side
  ;; (add-to-list 'display-buffer-alist
  ;;   '("\\*org-roam\\*"
  ;;      (display-buffer-in-side-window)
  ;;      (side . right)
  ;;      (slot . 0)
  ;;      (window-width . 0.33)
  ;;      (window-parameters . ((no-other-window . t)
  ;;                             (no-delete-other-windows . t)))))
  (setq org-link-frame-setup
   '((vm . vm-visit-folder-other-frame)
     (vm-imap . vm-visit-imap-folder-other-frame)
     (gnus . org-gnus-no-new-news)
     (file . find-file)
     (wl . wl-other-frame)))
  :custom
  (org-roam-db-update-method 'immediate)
  (org-roam-db-location "~/.emacs.d/org-roam.db")
  (org-roam-directory "~/DEV/orgfiles/roam/")
  (org-roam-index-file "~/DEV/orgfilesg/roam.org")
  ;; (org-roam-extract-new-file-path "%<%Y%m%d>-${slug}.org")
  (org-roam-db-update-on-save t)
  (org-roam-db-autosync-mode t)
  :hook
  (after-init . org-roam-mode)
  (org-roam-mode . org-roam-db-autosync-mode)
  :bind (
          :map org-mode-map
          (
            ("C-c n l" . org-roam-buffer-toggle)
            ("C-c n i" . org-roam-node-insert)
            ("C-c n f" . org-roam-node-find)
            ("C-c n g" . org-roam-graph)
            ("C-c n c" . org-roam-capture)
            )
          )
  )

(use-package org-web-tools
  :ensure t
  :bind (:map org-mode-map
          (
            ("C-c i l" . org-web-tools-insert-link-for-url)
            )
          )
  )


;;
;;ox-hugo
;;https://github.com/kaushalmodi/ox-hugo/discussions/551
(use-package ox-hugo
  :ensure t
  :after (ox)
  :config
  (eval . (org-hugo-auto-export-mode))
  (setq org-element-use-cache nil)
  )

;;
;;ob-rust
(use-package ob-rust
  :ensure t
  :after (org)
  )

;;
;;ob-typescript
(use-package ob-typescript
  :disabled
  :ensure t
  :after (org)
  )

;;
;;ob-javascript
(use-package ob-js
  :disabled
  :ensure t
  :after (org)
  )

;;
;;org-habit
(use-package org-habit
  :ensure nil
  :after (org)
  )
#+end_src

