.emacs.d/config/config.org
*** org-sticky-header
:PROPERTIES:
:ID:       58FD7B79-B068-4A90-9289-CE11686754D8
:END:
#+begin_src elisp
(use-package org-sticky-header
  :ensure t
  :defer t
  :hook (org-mode . org-sticky-header-mode)
  :config
  ;; Show full path in header
  (setq org-sticky-header-full-path 'full)
  ;; Use > instead of / as separator
  (setq org-sticky-header-outline-path-separator " > ")
  )
#+end_src

*** auth-source
:PROPERTIES:
:ID:       9822BAC6-DCC8-49A6-82A4-C5F501C284A3
:END:
#+begin_src elisp
(use-package auth-source
  :ensure nil
  :init
  (setq auth-source-debug t)
  (setq epg-gpg-program "gpg")
  (setq auth-sources '("~/.authinfo.gpg"))
  )
#+end_src

** shfmt
:PROPERTIES:
:ID:       83DD7300-B119-4AF8-859F-B53C1227422C
:END:
#+begin_src elisp
(use-package shfmt
  :ensure t
  :defer t
  :hook (
          (sh-mode . shfmt-on-save-mode)
          (bash-ts-mode . shfmt-on-save-mode)
          )
  :custom
  (shfmt-arguments '("-i" "2" "-bn" "-ci" "-sr"))
  )
#+end_src
** elisp format
:PROPERTIES:
:ID:       33DDB776-35E7-43A2-8907-FC167F3B9F99
:END:
#+begin_src elisp
(use-package elisp-format
  :disabled
  :ensure (
            :host github
            :repo "Yuki-Inoue/elisp-format"
            :branch "master"
            :depth 1
            :protocol https
            :files ("elisp-format.el")
            )
  )
#+end_src
** smartparens
:PROPERTIES:
:ID:       58AAAE7F-8F61-4ABA-A140-961546D49A4A
:END:
#+begin_src elisp
(use-package smartparens
  :ensure t
  :config
  (require 'smartparens-config)
  (smartparens-global-mode t)
  ;;(sp-pair "<" ">")
  )
#+end_src

** migemo
:PROPERTIES:
:ID:       81ED496F-F27B-457E-A339-F85F870D04ED
:END:
#+begin_src elisp
(use-package migemo
  :if (eq system-type 'darwin)
  :config
  ;; cmigemo(default)
  (add-to-list 'exec-path (expand-file-name "/opt/homebrew/bin")) ;; cmigemo
  (setq migemo-command "cmigemo")
  (setq migemo-options '("-q" "--nonewline" "--emacs"))
  ;; Set your installed path
  (setq migemo-dictionary "/opt/homebrew/Cellar/cmigemo/20110227/share/migemo/utf-8/migemo-dict")
  (setq migemo-user-dictionary nil)
  (setq migemo-regex-dictionary nil)
  (setq migemo-coding-system 'utf-8-unix)
  (migemo-init)
  )
#+end_src
** highlight-symbol
:PROPERTIES:
:ID:       200D08C8-6967-4AD4-8B86-39C0790EE802
:END:
#+begin_src elisp
(use-package highlight-symbol
  :ensure t
  :defer t
  :bind (
          ("C-<f3>" . highlight-symbol)
          ("<f3>" . highlight-symbol-next)
          ("S-<f3>" . highlight-symbol-prev)
          ("M-<f3>" . highlight-symbol-query-replace)
          )
  :config
  (highlight-symbol-mode  t)
  (setq highlight-symbol-idle-delay 0.5)
  :hook (flycheck-mode . highlight-symbol-mode)
  ;;自動ハイライト
  :hook (highlight-indentation-mode . highlight-symbol-mode)
  ;;ソースコードにおいてM-p/M-nでシンボル間を移動
  :hook (highlight-symbol-mode . highlight-symbol-nav-mode)
  )
#+end_src

** atomic-chrome
:PROPERTIES:
:ID:       6270CA8A-7A51-45C1-B19F-4EAE9BE7DF8C
:END:
#+begin_src elisp
(use-package atomic-chrome
  :if window-system
  :ensure t
  :defer t
  :init
  (atomic-chrome-start-server)
  :config
  (setq atomic-chrome-enable-auto-update t)
  (setq atomic-chrome-server-ghost-text-port 4002)
  (setq atomic-chrome-buffer-open-style 'split)
  )

#+end_src

** flycheck
:PROPERTIES:
:ID:       A9CE4C75-175D-417D-89C9-40A55A9A790E
:END:
#+begin_src elisp
(use-package flycheck
  :ensure t
  :defer t
  ;; :init (global-flycheck-mode)
  ;;(define-key global-map (kbd "\C-s") 'flycheck-next-error);Ctrl+sで次のエラーへ
  ;;(define-key global-map (kbd "\C-w") 'flycheck-previous-error);Ctrl+wで前のエラーへ
  ;;(define-key global-map (kbd "\C-a") 'flycheck-list-errors);Ctrl+aでエラー表示
  :config (remove-hook 'flymake-diagnostic-functions 'flymake-proc-legacy-flymake)
  ;; :mode ("\\.org\\'" . flycheck-mode)
  :hook (
          (org-mode . flycheck-mode)
          )
  )
#+end_src

** google-translate
:PROPERTIES:
:ID:       D02D4FA9-A17F-47A9-A400-5E66954DFFF5
:END:
#+begin_src elisp
(use-package google-translate
  :ensure t
  :defer t
  :config
  (setq google-translate-backend-method 'curl)
  (defvar google-translate-english-chars "[:ascii:]’“”–" "これらの文字が含まれているときは英語とみなす")
  (defun google-translate-enja-or-jaen (&optional string) "regionか、現在のセンテンスを言語自動判別でGoogle翻訳する。" (interactive)
    (setq string (cond ((stringp string) string)
                   (current-prefix-arg (read-string "Google Translate: "))
                   ((use-region-p)
                     (buffer-substring (region-beginning)
                       (region-end)))
                   (t (save-excursion (let (s)
                                        (forward-char 1)
                                        (backward-sentence)
                                        (setq s (point))
                                        (forward-sentence)
                                        (buffer-substring s (point)))))))
    (let* ((asciip (string-match (format "\\`[%s]+\\'" google-translate-english-chars) string)))
      (run-at-time 0.1 nil 'deactivate-mark)
      (google-translate-translate (if asciip "en" "ja")
        (if asciip "ja" "en") string)))
  ;; Fix error of "Failed to search TKK"
  (defun google-translate--get-b-d1 ()
    ;; TKK='427110.1469889687'
    (list 427110 1469889687))
  :bind ("C-c t" . google-translate-enja-or-jaen)
)
#+end_src

** dictionary mode
:PROPERTIES:
:ID:       378CAEA5-7870-4B66-9F57-DB63E282652C
:END:
** nov mode
:PROPERTIES:
:ID:       F81D04DE-BAF2-48DD-BB91-2CA7BE385F9F
:END:
#+begin_src elisp
(use-package nov
  :ensure t
  :if window-system
  :defer t
  :mode ("\\.epub\\'" . nov-mode)
  :custom
  (nov-variable-pitch nil)
  (nov-text-width t)
  :config
  :bind (:map nov-mode-map
          ("C-j" . nov-browse-url)
          )
  )
#+end_src

** w3m
:PROPERTIES:
:ID:       690A55CE-6F4F-422B-A629-F392AAF212A9
:END:
#+begin_src elisp
(use-package w3m
  :ensure t
  :defer t
  :after (markdown-mode)
  :config (defun w3m-browse-url-other-window (url &optional newwin)
            (let ((w3m-pop-up-windows t))
              (if (one-window-p)
                (split-window))
              (other-window 1)
              (w3m-browse-url url newwin)))
  (defun markdown-preview-by-eww ()
    (interactive)
    (message (buffer-file-name))
    (call-process "grip" nil nil nil "--gfm" "--export" (buffer-file-name) "/tmp/grip.html")
    (let ((buf (current-buffer)))
      (eww-open-file "/tmp/grip.html")
      (switch-to-buffer buf)
      (pop-to-buffer "*eww*")))
  (define-key markdown-mode-map "\C-c\C-c\C-p" 'markdown-preview-by-eww)

  ;; (setq markdown-command "multimarkdown")
  ;; (setq markdown-command "pandoc -c ~/.pandoc/github-markdown.css")
  (setq markdown-command "grip --export")
  (setq markdown-enable-math t)
  )
#+end_src

** eww
:PROPERTIES:
:ID:       61F5DF7F-E2C9-438C-9976-05944BCD0A37
:END:
#+begin_src elisp
(use-package eww
:ensure nil
  :defer t
  :custom
  (eww-auto-rename-buffer 'title)
  (eww-buffer-name-length 40)
  ;; :config
  )
#+end_src

** eshell
:PROPERTIES:
:ID:       9B5EDD66-A4A0-4666-B706-265D2C8CD23F
:END:
#+begin_src elisp
;;
#+end_src

** tramp
:PROPERTIES:
:ID:       D2C749DB-F755-4EC8-918D-8E4A3E6379F6
:END:
#+begin_src elisp
(use-package tramp
  :ensure nil
  :init
  (setq tramp-persistency-file-name "~/.emacs.d/.tramp")
  )
#+end_src

** shrface
:PROPERTIES:
:ID:       D512EF8C-4F6B-4A08-8667-E253242C3B31
:END:
#+begin_src elisp
(use-package shrface
  :ensure t
  :if window-system
  :defer t
  :after (eww nov)
  :config
  (setq
    shr-image-animate nil    ;  Disable animation
    shr-use-fonts nil        ;  Don't use custom fonts
    shr-width     80         ;  Word wrap at 70 chars
    shr-hr-line   "-----"        ;  Character for an <hr/> line
    shr-indentation 2        ;  Left margin
    ;;   shr-cookie-policy t      ;  Always accept cookies
    shrface-href-versatile t
    )
  :hook (
          (eww-mode . shrface-mode)
          (nov-mode . shrface-mode)
          )
  )
#+end_src

** puni
:PROPERTIES:
:ID:       66BBA8E5-2368-4968-98FA-08A9D92EB2F6
:END:

