.emacs.d/config/config.el

(use-package vertico
  :ensure t
  :init
  (vertico-mode)
  :custom
  ;; (vertico-scroll-margin 0) ;; Different scroll margin
  (vertico-count 15) ;; Show more candidates
  ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
  ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  )

(use-package consult
  :ensure t
  :after (migemo)
  :config
  (setq consult-async-refresh-delay 0.2)
  ;; @ref https://arialdomartini.github.io/consult-line-at-point
  (defun consult-line-symbol-at-point ()
    "Search for a line matching the symbol found near point."
    (interactive)
    (consult-line
      (or (thing-at-point 'symbol)))
    )
  ;; #TODO cmigemo
  :bind (
          ("C-x b" . consult-buffer)     ;; orig. switch-to-buffer
          ("C-x C-r" . consult-recent-file)
          ("C-x r b" . consult-bookmark)  ;; orig. bookmark-jump
          ("M-g g" . consult-goto-line)  ;; orig. goto-line
          ("M-g M-g" . consult-goto-line);; orig. goto-line
          ("C-s" . consult-line-symbol-at-point) ;; instead of consult-line
          ("C-r" . consult-line-symbol-at-point) ;; instead of consult-line
          ("C-c i" . consult-imenu)
          ("C-c I" . consult-imenu-multi)
          ("C-c l" . consult-locate)
          ("C-M-g" . consult-ripgrep)
          ("C-c g" . consult-ripgrep)
          ("C-M-y" . consult-yank-pop)
          ("C-c y" . consult-yank-pop)
          )
  )

(use-package consult-dir
  :ensure t
  :defer t
  :after consult
)

(use-package orderless
  :ensure t
  :config
  (with-eval-after-load 'minibuffer
    (setopt completion-styles '(orderless basic)
      completion-category-overrides '((file (styles basic partial-completion)))))
  )

(use-package marginalia
  :ensure t
  :config
  (marginalia-mode)
  )

(use-package embark
  :ensure t
  :defer t
  :init
  ;; Optionally replace the key help with a completing-read interface
  (setq prefix-help-command #'embark-prefix-help-command)

  ;; Show the Embark target at point via Eldoc. You may adjust the
  ;; Eldoc strategy, if you want to see the documentation from
  ;; multiple providers. Beware that using this can be a little
  ;; jarring since the message shown in the minibuffer can be more
  ;; than one line, causing the modeline to move up and down:

  ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
  ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

  ;; Add Embark to the mouse context menu. Also enable `context-menu-mode'.
  ;; (context-menu-mode 1)
  ;; (add-hook 'context-menu-functions #'embark-context-menu 100)

  :config
  ;; Hide the mode line of the Embark live/completions buffers
  ;; (add-to-list 'display-buffer-alist
  ;;              '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
  ;;                nil
  ;;                 (window-parameters (mode-line-format . none))))
  :bind  (
           ("C-." . embark-act)         ;; pick some comfortable binding
           ("C-;" . embark-dwim)        ;; good alternative: M-.
           ("C-h B" . embark-bindings) ;; alternative for `describe-bindings'
           )
  )

;; Consult users will also want the embark-consult package.
(use-package embark-consult
  :ensure t
  :defer t
  :hook
  (embark-collect-mode . consult-preview-at-point-mode)
  )

(use-package vterm
  :ensure t
  :defer t
  :custom
  (vterm-kill-buffer-on-exit t)
  (vterm-max-scrollback 10000)
  )

(use-package google-this
  :ensure t
  :bind
  ;; ("<f6>" . google-this-mode-submap)
  ("<f6>" . google-this-noconfirm)
  )

;;スペース、タブなどを可視化する;
;;(global - whitespace - mode 1)

;;(show-paren-mode t)
;; 括弧のハイライトの設定。mixed,parenthesis,expression
(setq show-paren-style 'mixed)
;; 選択範囲をハイライト
;;(transient-mark-mode t)

;;
;;Folding
;; cc-mode
(use-package emacs
  :ensure nil
  :config
  (add-hook 'c++-mode-hook '(lambda ()
                                      (hs-minor-mode 1)))
  (add-hook 'c-mode-hook '(lambda ()
                            (hs-minor-mode 1)))
  (add-hook 'emacs-lisp-mode-hook '(lambda ()
                                     (hs-minor-mode 1)))
  (add-hook 'lisp-mode-hook '(lambda ()
                               (hs-minor-mode 1)))
  (add-hook 'python-mode-hook '(lambda ()
                                 (hs-minor-mode 1)))
  (add-hook 'xml-mode-hook '(lambda ()
                              (hs-minor-mode 1)))
  (add-hook 'rust-mode-hook '(lambda ()
                               (hs-minor-mode 1)))
  ;; (bind-key "C-\\" 'hs-toggle-hiding c-mode-base-map)
  (bind-key "C-\\" 'hs-toggle-hiding)
)

;;
;;autoinsert-mode
(use-package emacs
  :ensure nil
  :init
  (auto-insert-mode 1)
  (setq auto-insert-query t) ;;; If you don't want to be prompted before insertion
  :hook (find-file-hooks . auto-insert)
  :config
  (setq auto-insert-alist
    (append '(
               (("\\.org\\'" . "org-mode template")
                 nil
                 "#+TITLE:"
                 (format-time-string "%Y/%m/%e(%a)")
                 " "
                 (file-name-nondirectory (buffer-file-name))
                 "\n"
                 "#+AUTHOR: Yuto TAGASHIRA\n"
                 "#+INFIX_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js\n"
                 (format "#+HTML_HEAD: <link rel=\"stylesheet\" type=\"text/css\" href=\"http://thomasf.github.io/solarized-css/solarized-light.min.css\" />\n")
                 "#+OPTIONS: ^:nil\n"
                 "#+OPTIONS: \\n:nil\n"
                 "#+OPTIONS: tex:t\n"
                 "#+options: auto-id:t"
                 "#+STARTUP: content"
                 "\n* Bookmark\n"
                 "\n* News\n"
                 "\n* Trivia\n"
                 > _
                 )
               ) auto-insert-alist))

  (setq auto-insert-alist
    (append '(
               (("\\.py\\'" . "python template")
                 nil
                 "#!/usr/bin/env python3\n"
                 "\n"
                 _
                 )
               ) auto-insert-alist))

  (setq auto-insert-alist
    (append '(
               (("\\.cpp\\'" . "cpp template")
                 nil
                 "/**\n"
                 "  @date Time-stamp: <2018-02-03 17:15:51 tagashira>\n"
                 "  @file "
                 (file-name-nondirectory (buffer-file-name))
                 "\n"
                 "  @brief\n"
                 "**/\n"
                 _
                 )
               ) auto-insert-alist))

  (setq auto-insert-alist
    (append '(
               (("\\.hpp\\'" . "hpp template")
                 nil
                 "/**\n"
                 "  @date Time-stamp: <2018-02-03 17:15:51 tagashira>\n"
                 "  @file "
                 (file-name-nondirectory (buffer-file-name))
                 "\n"
                 "  @brief\n"
                 "**/\n"
                 _
                 )
               ) auto-insert-alist))

  (setq auto-insert-alist
    (append '(
               (("\\.sh\\'" . "shellscript template")
                 nil
                 "#!/bin/bash\n"
                 "# @date Time-stamp: <2018-02-03 17:15:51 tagashira>\n"
                 "# @file "
                 (file-name-nondirectory (buffer-file-name))
                 "\n"
                 "# @brief\n"
                 "\n"
                 _
                 )
               ) auto-insert-alist))

  )

;;
