.emacs.d/config/config.org
** auto chmod +x
:PROPERTIES:
:ID:       C134E9F1-566C-4C51-9F19-6F3F93602406
:END:
#+begin_src elisp
;;
;;shebangが付いているファイルのパーミッションを保存時に +x にしてくれる設定
(defun my-chmod-script()
  (interactive)
  (save-restriction (widen)
    (let ((name (buffer-file-name)))
      (if (and (not (string-match ":" name))
            (not (string-match "/\\.[^/]+$" name))
            (equal "#!" (buffer-substring 1 (min 3 (point-max)))))
        (progn (set-file-modes name (logior (file-modes name) 73))
          (message "Wrote %s (chmod +x)" name)
          ))
     )
    )
  )
(add-hook 'after-save-hook 'my-chmod-script)
#+end_src

** replace zenkaku-hankaku
:PROPERTIES:
:ID:       66636C93-456B-4BCC-8E8F-4CB239B6CA43
:END:
#+begin_src elisp
;;
;; replace ten-maru to commma-period
(use-package emacs
  :ensure nil
  :defer t
  :config
  (defun my/replace-punctuation (a1 a2 b1 b2)
    (let ((s1 (if mark-active "selected region" "Buffer"))
           (s2 (concat a2 b2))
           (b (if mark-active (region-beginning) (point-min)))
           (e (if mark-active (region-end) (point-max))))
      (if (y-or-n-p (concat "Does " s1 " replace to " s2 "??"))
        (progn
          (replace-string a1 a2 nil b e)
          (replace-string b1 b2 nil b e)
          )
        )
      )
    )
  ;; (defun replace-punctuation-ten-to-maru ()
  ;;   "replace to [、。]"
  ;;   (interactive)
  ;;   (replace-punctuation "，" "、" "．" "。"))
  (defun my/replace-punctuation-comma-to-period ()
    "replace to [，．]"
    (interactive)
    (my/replace-punctuation "、" "，" "。" "．")
    )
  (defun my/replace-zenkaku-space-to-hankaku ()
    "replace [ ] to space"
    (interactive)
    (my/replace-punctuation "　" " " "　" " ")
    )
  (defun my/replace-zenkaku-paren-to-hankaku ()
    "replace （） to () "
    (interactive)
    (my/replace-punctuation "（" "(" "）" ")")
    )
  (defun my/replace-underline-to-hyphen ()
    "replace underline to hyphen"
    (interactive)
    (my/replace-punctuation "_" "-" "_" "-")
    )
  (defun my/replace-hyphen-to-underline ()
    "replace hypen to underline"
    (interactive)
    (my/replace-punctuation "-" "_" "-" "_")
    )
  ;; :hook (
  ;;         (before-save . my/replace-zenkaku-space-to-hankaku)
  ;;         (before-save . my/replace-zenkaku-paren-to-hankaku)
  ;;         )
  )
#+end_src

** lsp
:PROPERTIES:
:ID:       A4B70ABC-040D-400A-AE00-BB42E9D4421D
:END:
#+begin_src elisp
(use-package lsp-mode
  :if window-system
  :ensure t
  :commands lsp
  :after (yasnippet)
  :init
  (yas-global-mode)
  (add-to-list 'exec-path (expand-file-name "~/bin")) ;; rust-analyzer
  :hook ((rust-mode . lsp)
          (c-mode . lsp)
          (sh-mode . lsp)
          (bash-ts-mode . lsp)
          (typescript-mode . lsp)
          (html-mode . lsp)
          (css-mode . lsp)
          (js-mode . lsp)
          (dart-mode . lsp))
  :hook (before-save . lsp-format-buffer)
  :hook (lsp-mode . copilot-mode)
  ;; :bind ("C-c h" . lsp-describe-thing-at-point)
  :custom (lsp-rust-server 'rust-analyzer)
  (lsp-restart 'auto-restart)
  (lsp-headerline-breadcrumb-icons-enable nil)
  (lsp-lens-enable t)
  (lsp-signature-auto-activate t)
  (lsp-process-cleanup)
  ;; (setq
  ;; deno
  ;; lsp-clients-deno-enable-code-lens-references t
  ;; lsp-clients-deno-enable-code-lens-references-all-functions t
  ;; lsp-clients-deno-enable-lint t
  ;; lsp-clients-deno-enable-unstable nil
  ;; )
  :bind (
          ("<f2>" . 'lsp-rename)
          )
  )

(use-package lsp-ui
  :ensure t
  :defer t
  :custom
  ;; sideline
  (lsp-ui-sideline t)
  (lsp-ui-sideline-enable t)
  ;; lsp-ui-imenu
  (lsp-ui-imenu-auto-refresh t)
  :bind (:map lsp-mode-map
          ("<f12>" . 'lsp-ui-peek-find-definitions)
          ("<S-f12>" . 'lsp-ui-peek-find-references)
          )
  )
#+end_src

** lsp-booster
:PROPERTIES:
:ID:       CE5D834C-67D9-4725-8407-7FA227810D30
:END:
#+begin_src elisp

#+end_src

** cmake-mode
:PROPERTIES:
:ID:       ADE78BAF-BF7F-4CF4-BA9C-80BA3D6CAD17
:END:
#+begin_src elisp
;;
;; cmake-mode
(use-package cmake-mode
  :ensure t
  :mode (
          ("CMakeLists\\.txt\\'" . cmake-mode)
          ("\\.cmake\\'" . cmake-mode)
          )
  )
#+end_src

** toml-mode
:PROPERTIES:
:ID:       AFF310A6-6E83-4D88-A921-D5B13CE1D489
:END:
#+begin_src elisp
;;
;; toml-mode
(use-package toml-mode
  :ensure t
  :mode (
          ("\\.toml\\'" . toml-mode)
          )
  )
#+end_src

** yaml-mode
:PROPERTIES:
:ID:       2B4531C3-E464-4C24-B448-945A5A7D583A
:END:
#+begin_src elisp
;;
;; yaml mode
(use-package yaml-mode
  :ensure t
  :mode (
          ("\\.yml\\'" . yaml-mode)
          ("\\.yaml\\'" . yaml-mode)
          )
  )
#+end_src

** fish-mode
:PROPERTIES:
:ID:       BCBDAFDE-B1CC-499F-9E63-7C311CCFAE96
:END:
#+begin_src elisp
;;
;;fish-mode
(use-package fish-mode
  :ensure t
  :config (setq fish-indent-offset 2)
  )
#+end_src

** csv-mode
:PROPERTIES:
:ID:       E08A8197-3024-46DD-9193-C17F56D57011
:END:
#+begin_src elisp
;;
;; csv-mode
(use-package csv-mode
  :ensure t
  :mode (
          ("\\.csv\\'" . csv-mode)
          )
  )
#+end_src

** web-mode
:PROPERTIES:
:ID:       EDD8CA09-B164-4A1E-9379-3AC4FC60B389
:END:
** python-mode
:PROPERTIES:
:ID:       7DAC1100-B3FB-41D3-9903-C31AC81BF6EE
:END:
#+begin_src elisp
;;
;;python coding
(use-package python
  :ensure nil
  :mode ("\\.py\\'" . python-mode)
  :config
  (setq indent-tabs-mode nil
    indent-level 2
    ;; python-indent-offset 2
    python-indent 2
    tab-width 2
    ;; (define-key (current-local-map) "\C-h" 'python-backspace)
    )
  )

;;
;;company-jedi
(use-package epc
  :after (jedi-core)
  )

(use-package jedi-core
  :after (python)
  :config
  (setq jedi:complete-on-dot t)
  (setq jedi:use-shortcuts t)
  (add-to-list 'company-backends 'company-jedi) ; backendに追加
  :hook (python-mode-hook . jedi:setup)
  :config
  ;; PYTHONPATH上のソースコードがauto-completeの補完対象になる ;;;;;
  (setenv "PYTHONPATH" "/usr/local/lib/python2.7/site-packages")
  (setenv "PYTHONPATH" "/usr/local/lib/python3.5/dist-packages")
  (setenv "PYTHONPATH" "~/.local/lib/python2.7/site-packages")
  (setenv "PYTHONPATH" "~/.local/lib/python3.5/site-packages")
  )

;;
;;py-autopep8
(use-package py-autopep8
  :ensure t
  :after (python)
  :config
  (setq py-autopep8-options '("--max-line-length=200" "--indent-size=2"))
  (setq flycheck-flake8-maximum-line-length 200)
  :hook (python-mode-hook . py-autopep8-enable-on-save)
  :bind (:map python-mode-map
          ("C-c C-q" . 'py-autopep8)
          )
  )
;;
;; ein
(use-package ein
  :if (display-graphic-p)
  :ensure t
  :config
  (setq
    jedi:complete-on-dot t
    ein:worksheet-enable-undo t
    ein:output-area-inlined-images t
    )

  :hook (
          ;; (ein:notebook-mode . jedi:setup)
          ;; (ein:notebook-mode . electric-pair-mode)
          (ein:notebook-mode . undo-tree-mode)
          )
  )
#+end_src
** markdown-mode
:PROPERTIES:
:ID:       BEFB3C6A-83FB-42CB-872E-1F4CB26DA129
:END:
=markdown-edit-code-block= で別バッファを開ける

#+begin_src elisp
(use-package edit-indirect
  :ensure t
)

(use-package markdown-mode
  :ensure t
  :mode ("\\.md\\'" . gfm-mode)
  :after (edit-indirect)
  :config
  (setopt markdown-fontify-code-blocks-natively t)
  (setopt markdown-header-scaling t)
  (setopt markdown-indent-on-enter 'indent-and-new-item)
  (setopt markdown-list-indent-width 2)
  (setopt markdown-enable-math t)
  (setopt markdown-enable-wiki-links t)
  :bind (
          ("C-}" . markdown-promote)
          ("C-{" . markdown-demote)
          )
  )
#+end_src

** rust-mode
:PROPERTIES:
:ID:       10AA3E84-83C0-4B81-B9CD-5E3ADAE0B3F9
:END:
#+begin_src elisp
(use-package rust-mode
  :ensure t
  :custom
  (rust-format-on-save t)
  (rust-indent-offset 2)
  :config
  (add-to-list 'exec-path (expand-file-name "~/bin")) ;; rust-analyzer
  (add-to-list 'exec-path (expand-file-name "~/.cargo/bin")) ;; rustfmt,clippy,rust-analyzer
  )

(use-package cargo
  :ensure t
  :hook (rust-mode . cargo-minor-mode)
  )
#+end_src

** cc-mode
:PROPERTIES:
:ID:       69A14536-0E9D-4EE7-8C1C-8072C7192594
:END:
#+begin_src elisp
(use-package cc-mode
  :ensure nil
  :config
  (setq-default c-basic-offset 2 tab-width 2 indent-tabs-mode nil)
  )

;;
;; multi-compile
#+end_src

** clang-format
:PROPERTIES:
:ID:       BB66768E-EAD9-4C1E-92C2-9A9FDF6A2810
:END:
#+begin_src elisp
  (use-package clang-format
    :ensure t
    :init
    (setq clang-format-style-option "file")
    (defun my/enable-clang-format-on-save ()
      "現在のバッファ限定で before-save-hook に登録。"
      (interactive)
      (add-hook 'before-save-hook #'clang-format-buffer nil t)
      )
    :bind (:map c-mode-base-map
                ("C-c <down>" . clang-format-buffer)
                )
    )
#+end_src

