.emacs.d/config/config.org
** multi-compile
:PROPERTIES:
:ID:       74E8C76C-5F05-42D1-A95E-80A095CB7C0E
:END:
#+begin_src elisp
(use-package multi-compile
  :ensure t
  :defer t
  :commands (multi-compile-run)
  :config
  (setq multi-compile-alist '((c++-mode . (("yukicoder test" . "yuki test %file-sans")
                                            ("yukicoder system" . "yuki sys %file-sans")
                                            ("yukicoder submit(quiet)" . "yuki subforce %file-sans")
                                            ("yukicoder commit" . "yuki commit %file-sans")
                                            ("AtCoder test" . "act test %file-sans")
                                            ("AtCoder system" . "act sys %file-sans")
                                            ("AtCoder submit(quiet)" . "act subforce %file-sans")
                                            ("AtCoder commit" . "act commit %file-sans")))))
  :bind (:map c-mode-base-map ("C-c C-c" . multi-compile-run))
  )
#+end_src

