.emacs.d/config/config.org
* ALL(tmp)
:PROPERTIES:
:ID:       A7E47C1D-69C3-4DE9-AC1E-E7B6356F6B66
:END:
#+BEGIN_SRC elisp
(defun on-after-init ()
  (unless (display-graphic-p (selected-frame))
    (set-face-background 'default "unspecified-bg" (selected-frame))))

(add-hook 'window-setup-hook 'on-after-init)

;;
;;shell
(setq sh-basic-offset 2)

;;
;;lisp
(setq lisp-indent-offset 2)


;;
;;visible-bell
(when (memq window-system '(mac ns))
  (setq visible-bell nil))


;;
;;point-undo.el
(use-package point-undo
  :ensure nil
  :defer t
  :load-path "site-lisp"
  :config (bind-key* "<f7>" 'point-undo)
  (bind-key* "C-<f7>" 'point-redo)
  )


;;
;; paredit.el
(use-package paredit
  :ensure t
  :defer t
  )

;;
;;eldoc
(use-package eldoc
  :defer t
  :ensure nil)

;;
;;eldoc-extention
;; (install-elisp-from-emacswiki "eldoc-extension.el")
(use-package eldoc-extension
  :defer t
  :ensure nil
  :load-path "site-lisp"
  :config (setq eldoc-idle-delay 0.01)
  (setq eldoc-echo-area-use-multiline-p t)
  :hook (emacs-lisp-mode . eldoc-mode)
  :hook (lisp-interaction-mode . eldoc-mode)
  :hook (ielm-mode . eldoc-mode))

;;
;;c-eldoc
(use-package c-eldoc
  :ensure t
  :defer t
  :config
  :hook (c-mode . c-turn-on-eldoc-mode)
  )

;;
;;session
(use-package session
  :disabled
  :ensure nil
  :init (setq history-length 10000)
  (setq session-initialize '(de-saveplace session keys menus places) session-globals-include '((kill-ring 50)
                                                                                                (session-file-alist 500 t)
                                                                                                (file-name-history 10000)))
  (setq session-undo-check -1)
  :hook (after-init session-initialize))

;;
;;undohist
(use-package undohist
  :ensure t
  :init (undohist-initialize)
  :custom
  (
    undohist-directory (expand-file-name "~/.emacs.d/.undohist")
    undohist-ignored-files '("/temp/" "/elpa" "elfeed"))
  )

;;
;;undo-tree
(use-package undo-tree
  :ensure t
  :init (global-undo-tree-mode)
  :bind (
          ("M-/" . undo-tree-redo)
          ("M-z" . undo-tree-undo)
          )
  :custom
  (
    undo-tree-auto-save-history nil undo-tree-visualizer-timestamps t
    ;; undo-tree-history-directory-alist '((expand-file-name "~/.emacs.d/.undo-tree"))
    undo-tree-visualizer-diff t)
  )

;;
;; treesit
(use-package treesit
  :ensure nil
  :config (setq treesit-font-lock-level 4)
  )

;;
;; tree-sitter
(use-package treesit-auto
  :ensure t
  :config
  (setq treesit-auto-install 'prompt)
  (setq treesit-auto-install t)
  (global-treesit-auto-mode)
  )

;;
;;company
(use-package company
  :disabled
  :ensure t
  :defer t
  :diminish company-mode
  :init   (global-company-mode 1) ; 全バッファで有効にする
  :config (setq company-idle-delay 0.01) ; デフォルトは0.5
  ;;(setq company-idle-delay nil);;手動補完
  (setq company-minimum-prefix-length 2) ; デフォルトは4
  (setq company-selection-wrap-around t) ; 候補の一番下でさらに下に行こうとすると一番上に戻る
  (setq company-idle-delay nil) ; 自動補完をしない
  (setq company-tooltip-align-annotations t)
  (setq company-tooltip-flip-when-above t)
  (setq company-show-numbers t)   ;; Easy navigation to candidates with M-<n>
  (add-to-list 'company-backends 'company-files)
  :bind ("C-M-i" . company-complete)
  :bind (:map company-active-map ("C-n" . 'company-select-next )
          ("C-p" . 'company-select-previous)
          ("C-r" . 'company-filter-candidates)
          ("C-m" . 'company-complete-selection)
          ("C-i" . 'company-show-doc-buffer))
  :custom-face (flyspell-duplicate ((t (:foreground "white"
                                         :box nil
                                         :bold nil
                                         :underline nil))))
  (company-scrollbar-fg  ((t (:background "orange"))))
  (company-scrollbar-bg  ((t (:background "gray40")))))

;;volatile-highlights
(use-package volatile-highlights
  :ensure t
  :defer 30
  :config
  (volatile-highlights-mode t)
  )

;;docker.el
(use-package docker
  :ensure t
  :bind ("C-c d" . docker)
  )

(use-package dockerfile-mode
  :ensure t
  :commands dockerfile-mode
  :init (add-to-list 'auto-mode-alist '("Dockerfile\\'" . dockerfile-mode)))


;;
;; gtags
(use-package counsel-gtags
  :disabled
  :ensure t
  :init (counsel-gtags-mode 1)
  :config
  :hook (c-mode-hook . counsel-gtags-mode)
  :hook (c++-mode-hook . counsel-gtags-mode)
  :hook (python-mode-hook . counsel-gtags-mode)
  :bind (:map counsel-gtags-mode-map ("M-t" . 'counsel-gtags-find-definition) ;;入力されたタグの定義元へジャンプ
          ("M-r" . 'counsel-gtags-find-reference) ;;入力タグを参照する場所へジャンプ
          ("M-s" . 'counsel-gtags-find-symbol) ;;入力したシンボルを参照する場所へジャンプ
          ("M-," . 'counsel-gtags-go-backward) ;;ジャンプ前の場所に戻る
          ("M-." . 'counsel-gtags-go-forward)
          ("M-l" . 'counsel-gtags-dwim) ;;タグ一覧からタグを選択し, その定義元にジャンプする
          ))

;;
;;rtags
(use-package rtags
  :disabled
  :ensure nil
  :load-path "/opt/homebrew/Cellar/rtags/2.38/share/emacs/site-lisp/rtags/"
  :hook (c-mode . rtags-start-process-unless-running)
  :hook (c++-mode . rtags-start-process-unless-running)
  :config (setq rtags-completions-enabled t)
  (setq rtags-autostart-diagnostics t))

;;
;;company-rtags
(use-package company-rtags
  :disabled
  :ensure nil
  :load-path "/opt/homebrew/Cellar/rtags/2.38/share/emacs/site-lisp/rtags/")

;;
;; dart-mode
(use-package dart-mode
  :disabled
  :ensure t
  :defer t
  :mode ("\\.dart\\'" . dart-mode)
  :interpreter "dart"
  :custom (dart-format-on-save t)
  (dart-sdk-path "/opt/homebrew/bin/dart")
  :config
  ;; function run dart format on save
  (defun my/dart-fix-trailinkg-commas ()
    (interactive)
    (when (eq major-mode 'dart-mode)
      (message "Apply: dart fix --apply --code=require_trailing_commas")
      (call-process-shell-command "dart fix --apply --code=require_trailing_commas" nil 0)
      (call-process-shell-command "dart format ." nil 0)))
  :hook ((dart-mode . flycheck-mode)
          ;; (dart-mode . colilot-mode)
          (before-save . my/dart-fix-trailinkg-commas)))

(use-package lsp-dart
  :ensure t
  :defer t
  :custom (lsp-dart-enable-sdk-formatter t)
  ;; (lsp-dart-suggest-from-unimported-libraries nil)
  ;; (lsp-dart-main-code-lens nil)
  ;; (lsp-dart-flutter-widget-guides nil)
  (lsp-dart-test-tree-line-spacing 2)
  :bind (
          ("<f5>" . lsp-dart-run)
          )
  )

(add-to-list 'auto-mode-alist '("\\.nas\\'" . asm-mode))

;;
;; flutter.el
(use-package flutter
  :disabled
  :ensure t
  :defer t
  :after dart-mode
  :bind (:map dart-mode-map ("C-M-x" . #'flutter-run-or-hot-reload))
  :custom (flutter-sdk-path "/opt/homebrew/bin/")
  ;; :hook (dart-mode . (lambda ()
  ;;                      (add-hook 'after-save-hook #'flutter-run-or-hot-reload nil t)
  ;;                      )
  ;;         )
  )

;;
;; copilot
(use-package copilot
  :disabled
  :ensure (:host github
            :repo "copilot-emacs/copilot.el"
            :branch "main"
            :depth 1
            :protocol https
            :files ("dist" "*.el"))
  :defer t
  :custom
  (copilot-node-executable "/opt/homebrew/bin/node")
  (copilot-indent-offset-warning-disable t)
  :bind (:map copilot-completion-map ("TAB" . copilot-accept-comletion)
          ("<tab>" . 'copilot-accept-completion)
          ("C-TAB" . 'copilot-accept-completion-by-word)
          ("C-<tab>" . 'copilot-accept-completion-by-word))
  :hook((emacs-lisp-mode . copilot-mode)))

;;ansi-color
(require 'ansi-color)
(add-hook 'compilation-filter-hook '(lambda ()
                                      (ansi-color-apply-on-region (point-min)
                                        (point-max))))

;; compile
(setq compilation-scroll-output t)

;;
;; typescript-mode
(use-package typescript-mode
  :ensure t
  :defer t
  :mode (("\\.ts\\'" . typescript-mode)
          ("\\.tsx\\'" . typescript-mode))
  :custom (typescript-indent-level 2))

;;
;; prettier
(use-package prettier-js
  :disabled
  :ensure t
  :config
  ;; (setq prettier-js-args '(
  ;;                           "--trailing-comma" "all"
  ;;                           "--bracket-spacing" "false"
  ;;                           ))
  (defun prettier-buffer ()
    (interactive)
    (shell-command (format "%s --write %s" (shell-quote-argument (executable-find "prettier"))
                     (shell-quote-argument (expand-file-name buffer-file-name))))
    (revert-buffer t t t))
  :hook (web-mode-hook . prettier-js-mode)
  :hook (web-mode-hook . (lambda ()
                           (add-hook 'after-save-hook 'my/prettier t t))))

;;
;;tide
(use-package tide
  :disabled
  :ensure t
  :defer t
  :after (typescript-mode)
  ;; :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
          (typescript-mode . tide-hl-identifier-mode)
          (before-save . tide-format-before-save)))

;;
;; js2-mode
(use-package js2-mode
  :disabled
  :ensure t
  :defer t
  :mode (("\\.js\\'" . js2-mode))
  :custom (js-indent-level 2))

;;
;; rainbow-delimiters
(use-package rainbow-delimiters
  :ensure t
  :defer t
  :after (cl-lib color)
  :config (cl-loop for index from 1 to rainbow-delimiters-max-face-count do (let ((face (intern (format "rainbow-delimiters-depth-%d-face" index))))
                                                                              (cl-callf color-saturate-name (face-foreground face) 30)))
  :hook (prog-mode-hook . rainbow-delimiters-mode))


;;
;;
(add-hook 'comint-exec-hook (lambda ()
                              (set-process-query-on-exit-flag (get-buffer-process (current-buffer)) nynil)))
#+END_SRC

