.emacs.d/config/config.org
* Speed up end
:PROPERTIES:
:ID:       85C2647E-81C2-400F-AE00-FD4C45772196
:END:
Magic File Name を一時的に無効にする
#+begin_src elisp
(setq file-name-handler-alist my/saved-file-name-handler-alist)
#+end_src

reset garbage collection threshold
#+begin_src elisp
(setq gc-cons-threshold 800000)
#+end_src
