.emacs.d/config/config.el

(setq gc-cons-threshold 800000)
